##  1. 데이터셋  영화 타이틀 데이터 셋. 
      -. moves_title.csv 
  2. titles의 Data Frame을 만든다. 
  3. df 필수 명령 8가지 실행 

  4. 전체 영화는 몇개인가? 
  5. 가장 빠른 시기에 제작된 영화 2개를 찾아라. 
  6. 제목이 "Hamlet"인 영화는 몇개인가? 
  7. 제목이 "Treasure Island"는 몇개인가? 제작년도 오름차순으로 나열
  8. 1950년에서 1959년사이에 만들어진 영화는 몇개인가? 

  다 끝나신분.. numpy quickstart 학습.. 
  https://numpy.org/doc/stable/user/quickstart.html

In [1]:
import pandas as pd

In [5]:
movies_title =pd.read_csv("c:/movies_title.csv")
movies_title

                          title  year
0                The Rising Son  1990
1             Ashes of Kukulcan  2016
2       The Thousand Plane Raid  1969
3              Crucea de piatra  1993
4                        The 86  2015
...                         ...   ...
215976           Le mouton noir  1922
215977      Edge of the Unknown  2015
215978                    E yue  2005
215979             Lakota Girls  2015
215980             The Sting II  1983

[215981 rows x 2 columns]

In [7]:
movies_title.shape

(215981, 2)

In [8]:
movies_title.head()

                     title  year
0           The Rising Son  1990
1        Ashes of Kukulcan  2016
2  The Thousand Plane Raid  1969
3         Crucea de piatra  1993
4                   The 86  2015

In [11]:
movies_title.tail()

                      title  year
215976       Le mouton noir  1922
215977  Edge of the Unknown  2015
215978                E yue  2005
215979         Lakota Girls  2015
215980         The Sting II  1983

In [116]:
movies_title.columns

Index(['title', 'year'], dtype='object')

In [14]:
movies_title.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 215981 entries, 0 to 215980
Data columns (total 2 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   title   215981 non-null  object
 1   year    215981 non-null  int64
dtypes: int64(1), object(1)
memory usage: 3.3+ MB

In [15]:
movies_title.describe()

                year
count  215981.000000
mean     1984.553822
std        29.343957
min      1894.000000
25%      1965.000000
50%      1994.000000
75%      2010.000000
max      2024.000000

In [97]:
#영화갯수
a = movies_title["title"].unique()
len(a)

197575

In [42]:
#최근제작 2개
movies_title.sort_values("year",ascending = False).head(2)

                 title  year
199790  New in Village  2024
44198        Wild Runs  2024

In [80]:
# 햄릿 개수
movies_title["title"].value_counts()

Hamlet                     19
Carmen                     14
Macbeth                    14
The Three Musketeers       12
Maya                       11
                           ..
Los relajados               1
SOS Conspiracion Bikini     1
Moskva, lyubov moya         1
The Sundown Kid             1
Puos Keng Kang              1
Name: title, Length: 197575, dtype: int64

In [134]:
#년도 사이 갯수 세기
y = movies_title["year"]; y
y1 = []
for i in y:
    if 1950<= i <=1959:
        y1.append(i)
len(y1)

12120